# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 1 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.25 # layer channel multiple
# anchors:
#   - [10, 13, 16, 30, 33, 23] # P3/8
#   - [30, 61, 62, 45, 59, 119] # P4/16
#   - [116, 90, 156, 198, 373, 326] # P5/32
anchors:
  - [5,10, 8,12, 10,15]      # P3  (stride 8)   ┐
  # - [24,64, 32,96, 40,120]     # P4  (stride 16)  │  모두 가로:세로 ≈ 0.4~0.5
  # - [48,160, 64,192, 80,224]   # P5  (stride 32)  ┘
  # - [22,44, 25,57, 33,75]  # P3/8
  - [25,45, 35,55, 45,75]  # P4/16
  - [68,120, 77,150, 92,190]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MultiStreamConv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, MultiStreamConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, MultiStreamC3, [128]],
    [-1, 1, Fusion, ['concat', 2]],
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, Conv, [256, 3, 2]], # 5-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 7-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 9-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 11
  ]

# YOLOv5 v6.0 head
head: [
    # --- P5 → P4 경로 ---
    [-1, 1, Conv, [512, 1, 1]],           # 12
    [-1, 1, nn.Dropout2d, [0.4]],     # 13   ↓ p=0.4
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # 14
    [[-1, 7], 1, Concat, [1]],            # 15
    [-1, 3, C3, [512, False]],            # 16  (P4 특성)
    [-1, 1, nn.Dropout2d, [0.4]],     # 17

    # --- P4 → P3 경로 ---
    [-1, 1, Conv, [256, 1, 1]],           # 18
    [-1, 1, nn.Dropout2d, [0.4]],     # 19
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # 20
    [[-1, 5], 1, Concat, [1]],            # 21
    [-1, 3, C3, [256, False]],            # 22  (P3 특성)
    [-1, 1, nn.Dropout2d, [0.4]],     # 23

    # --- P3 → P4 복원 경로 ---
    [-1, 1, Conv, [256, 3, 2]],           # 24
    [[-1, 16], 1, Concat, [1]],           # 25  (16은 P4 C3)
    [-1, 3, C3, [512, False]],            # 26  (P4 특성 - refined)
    [-1, 1, nn.Dropout2d, [0.4]],     # 27

    # --- P4 → P5 복원 경로 ---
    [-1, 1, Conv, [512, 3, 2]],           # 28
    [[-1, 11], 1, Concat, [1]],           # 29  (11은 SPPF)
    [-1, 3, C3, [1024, False]],           # 30  (P5 특성 - refined)
    [-1, 1, nn.Dropout2d, [0.4]],     # 31

    # Detect (P3=22, P4=26, P5=30)
    [[22, 26, 30], 1, Detect, [nc, anchors]],    # 32
]

